app/views/home/index.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = $1  [["user_id", 1]]
---
            <p>Event till <%= Date.today %></p>
            <%= "Events (#{current_user.events.count})" %>