app/controllers/events_controller.rb

  def create
    @event = current_user.events.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "when", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["when", "2016-02-25"], ["user_id", 1], ["created_at", "2016-02-25 09:01:19.209134"], ["updated_at", "2016-02-25 09:01:19.209134"]]