app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_id", 2], ["user_id", 1], ["created_at", "2016-02-23 11:16:06.364559"], ["updated_at", "2016-02-23 11:16:06.364559"]]
---
   def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 2]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 2]]
---
  def destroy
    @friendship = current_user.friendships.find(params[:id])
    @friendship.destroy