app/controllers/home_controller.rb

SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = $1  [["user_id", 1]]
---
  def index
    @post = Post.new
    @activities = Post.where(:user_id => current_user.id).order(created_at: :desc).paginate(page: params[:page], per_page: 5)
    @event = Event.where(:user_id => current_user.id).order(created_at: :desc).paginate(page: params[:page], per_page: 5)