app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def index
    @post = Post.new
    @activities = Post.where(:user_id => current_user.id).order(created_at: :desc)
    @event = Event.where(:user_id => current_user.id)

SELECT "users".* FROM "users"
---
  def find_friends
   @users= User.where.not(:id=>current_user.id)

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 1]]
---
  def all_activites
    @friendships = Friendship.where("user_id = ?",current_user.id).select("friend_id")
    @activities = Post.where("user_id in (?)",@friendships)