app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)
    respond_to do |format|
     if @post.save
---
INSERT INTO "posts" ("content", "attachment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "attach"], ["attachment", "2014_7_largeimg223_Jul_2014_091325173.jpg"], ["user_id", 1], ["created_at", "2016-02-28 23:18:00.970606"], ["updated_at", "2016-02-28 23:18:00.970606"]]

  def update
    @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "hello"], ["updated_at", "2016-02-22 10:06:10.580406"], ["id", 1]]